#2) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

a = ['a', 'b', 'c']
b = [1, 2, 3]
print(a + b)